label_map = \
{
 0: '팥_흰가루병',
 1: '팥_세균잎마름병',
 2: '팥_Rhizopus',
 3: '참깨_세균성점무늬병',
 4: '참깨_흰가루병',
 5: '콩_노균병',
 6: '콩_들불병',
 7: '콩_불마름병',
 8: '콩_병징',
 9:  '팥 정상',
 10: '참깨 정상',
 11: '콩 정상',
#----------시설 질병------------
 12: '가지잎곰팡이병',
 13: '가지흰가루병',
 14: '고추마일드모틀바이러스병',
 15: '고추점무늬병',
 16: '단호박점무늬병',
 17: '단호박흰가루병',
#    '딸기잿빛곰팡이병' # Sample 수 부족 (8개)
 18: '딸기흰가루병',
 19: '상추균핵병',
 20: '상추노균병',
 21: '수박탄저병',
 22: '수박흰가루병',
 23: '애호박점무늬병',
 24: '오이녹반모자이크바이러스',
 25: '쥬키니호박 오이녹반모자이크바이러스',
 26: '참외노균병',
 27: '참외흰가루병',
 28: '토마토잎곰팡이병',
 29: '토마토황화잎말이바이러스병',
 30: '포도노균병',
#-----------노지 질병-----------
#    '고추탄저병' # 잎 이미지가 존재하지 않음
 31: '고추흰가루병',
 32: '무검은무늬병',
 33: '무노균병',
 34: '배추검은썩음병',
 35: '배추노균병',
 36: '애호박노균병',
 37: '애호박흰가루병',
 38: '양배추균핵병',
 39: '양배추무름병',
 40: '오이노균병',
 41: '오이흰가루병',
# ★ '콩불마름병' # Capstone 데이터셋과 동일한 질병
 42: '콩점무늬병',
 43: '토마토잎마름병',
 44: '파검은무늬병',
 45: '파노균병',
 46: '파녹병',
 47: '호박노균병',
 48: '호박흰가루병',
#---------과수화상병----------
#    '배검은별무늬병' # Sample 수 부족 (1개)
 49: '배과수화상병',
 50: '사과갈색무늬병',
 51: '사과과수화상병',
#    '사과부란병'     # Sample 수 부족 (7개)
 52: '사과점무늬낙엽병',
#    '사과탄저병',    # 잎 이미지가 존재하지 않음
#----------정상-------------
53: '가지 정상',
54: '고추 정상',
55: '단호박 정상',
56: '딸기 정상',
57: '상추 정상',
58: '수박 정상',
59: '애호박 정상',
60: '오이 정상',
61: '쥬키니호박 정상',
62: '참외 정상',
63: '토마토 정상',
64: '포도 정상',
65: '무 정상',
66: '배추 정상',
67: '양배추 정상',
68: '파 정상',
69: '호박 정상',
70: '배 정상',
71: '사과 정상'
}

crop_map = \
{
 0: '팥',
 1: '팥',
 2: '팥',
 3: '참깨',
 4: '참깨',
 5: '콩',
 6: '콩',
 7: '콩',
 8: '콩',
 9:  '팥',
 10: '참깨',
 11: '콩',
#----------시설 질병------------
 12: '가지',
 13: '가지',
 14: '고추',
 15: '고추',
 16: '단호박',
 17: '단호박',
#    '딸기잿빛곰팡이병' # Sample 수 부족 (8개)
 18: '딸기',
 19: '상추',
 20: '상추',
 21: '수박',
 22: '수박',
 23: '애호박',
 24: '오이',
 25: '쥬키니호박',
 26: '참외',
 27: '참외',
 28: '토마토',
 29: '토마토',
 30: '포도',
#-----------노지 질병-----------
#    '고추탄저병' # 잎 이미지가 존재하지 않음
 31: '고추',
 32: '무',
 33: '무',
 34: '배추',
 35: '배추',
 36: '애호박',
 37: '애호박',
 38: '양배추',
 39: '양배추',
 40: '오이',
 41: '오이',
# ★ '콩불마름병' # Capstone 데이터셋과 동일한 질병
 42: '콩',
 43: '토마토',
 44: '파',
 45: '파',
 46: '파',
 47: '호박',
 48: '호박',
#---------과수화상병----------
#    '배검은별무늬병' # Sample 수 부족 (1개)
 49: '배',
 50: '사과',
 51: '사과',
#    '사과부란병'     # Sample 수 부족 (7개)
 52: '사과',
#    '사과탄저병',    # 잎 이미지가 존재하지 않음
#----------정상-------------
 53: '가지',
 54: '고추',
 55: '단호박',
 56: '딸기',
 57: '상추',
 58: '수박',
 59: '애호박',
 60: '오이',
 61: '쥬키니호박',
 62: '참외',
 63: '토마토',
 64: '포도',
 65: '무', 
 66: '배추',
 67: '양배추',
 68: '파',
 69: '호박',
 70: '배',
 71: '사과',
}

disease_healthy_map = \
{   
 '0' : '9',     #'팥_흰가루병',
 '1' : '9',     #'팥_세균잎마름병',
 '2' : '9',     #'팥_Rhizopus',
 '3' : '10',    #'참깨_세균성점무늬병',
 '4' : '10',    #'참깨_흰가루병',
 '5' : '11',    #'콩_노균병',
 '6' : '11',    #'콩_들불병',
 '7' : '11',    #'콩_불마름병',
 '8' : '11',    #'콩_병징',
 '12': '53',    #'가지잎곰팡이병',
 '13': '53',    #'가지흰가루병',
 '14': '54',    #'고추마일드모틀바이러스병',
 '15': '54',    #'고추점무늬병',
 '16': '55',    #'단호박점무늬병',
 '17': '55',    #'단호박흰가루병',
#    '딸기잿빛곰팡이병' # Sample 수 부족 (8개)
 '18': '56',    #'딸기흰가루병',
 '19': '57',    #'상추균핵병',
 '20': '57',    #'상추노균병',
 '21': '58',    #'수박탄저병',
 '22': '58',    #'수박흰가루병',
 '23': '59',    #'애호박점무늬병',
 '24': '60',    #'오이녹반모자이크바이러스',
 '25': '61',    #'쥬키니호박 오이녹반모자이크바이러스',
 '26': '62',    #'참외노균병',
 '27': '62',    #'참외흰가루병',
 '28': '63',    #'토마토잎곰팡이병',
 '29': '63',    #'토마토황화잎말이바이러스병',
 '30': '64',    #'포도노균병',
#-----------노지 질병-----------
#    '고추탄저병' # 잎 이미지가 존재하지 않음
 '31': '54',    #'고추흰가루병',
 '32': '65',    #'무검은무늬병',
 '33': '65',    #'무노균병',
 '34': '66',    #'배추검은썩음병',
 '35': '66',    #'배추노균병',
 '36': '59',    #'애호박노균병',
 '37': '59',    #'애호박흰가루병',
 '38': '67',    #'양배추균핵병',
 '39': '67',    #'양배추무름병',
 '40': '60',    #'오이노균병',
 '41': '60',    #'오이흰가루병',
#' ★' ',#콩불마름병' # Capstone 데이터셋과 동일한 질병
 '42': '11',    #'콩점무늬병',
 '43': '63',    #'토마토잎마름병',
 '44': '68',    #'파검은무늬병',
 '45': '68',    #'파노균병',
 '46': '68',    #'파녹병',
 '47': '69',    #'호박노균병',
 '48': '69',    #'호박흰가루병',
#'---------'과수,#화상병----------
#'    '배검은별무늬병'' ,## Sample 수 부족 (1개)
 '49': '70',    #'배과수화상병',
 '50': '71',    #'사과갈색무늬병',
 '51': '71',    #'사과과수화상병',
#    '사과부란병'     # Sample 수 부족 (7개)
 '52': '71'     #'사과점무늬낙엽병',
}

import numpy as np
def get_crop_map():
    return crop_map

def get_crop_mask():
    global crop_map
    outer = []
    for i in list(crop_map.values()):
        inner = []
        for j in list(crop_map.values()):
            if i == j: inner.append(1)
            else     : inner.append(0)
        outer.append(inner)

    outer = np.array(outer)
    return outer

def get_label_map():
    return label_map

def get_disease_healthy_map():
    return disease_healthy_map